sq1 = float(input("Площа заданого квадрата = "))
a1 = float(sq1 ** 0.5) # знаходження сторони більшого квадрату
r = float(a1 / 2) # знаходження радіуса кола, вписаного в більш. квадрат
# r також є радіусом кола описаного навколо менш. квадрата
a2 = float(r * (2 ** 0.5)) # знаходимо сторону менш. квадрата за формулою
sq2 = float(a2 ** 2) # знаходимо площу меншого кв.
result = round(float(sq1 / sq2)) # рахуємо, у скільки разів заданий квадрат більше другого квадрата
print(f"Площа меншого квадрату = {sq2} ")
print(f"Площа заданого квадрату у {result} більше за площу меншого квадрату" )

